app/views/chat_rooms/show.html.erb

SELECT "messages".* FROM "messages" WHERE "messages"."chat_room_id" = 1
SELECT COUNT(*) FROM "messages" WHERE "messages"."chat_room_id" = ?  [["chat_room_id", 1]]
---
<div id="messages" data-chat-room-id="<%= @chat_room.id %>">
	<%=  @chat_room.messages.count %> Here is where I need to display saved messages